# iMPORTING LIBRARIES

In [74]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

##  IMPORTING DATASET

In [75]:
data = pd.read_csv('titanic.csv')

In [76]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## DETERMINING INDEPENDENT AND DEPENDENT VARIABLES

In [77]:
# INDEPEMDENT VARIABLES
x = data.drop('Survived', axis=1)

# DEPENDENT VARIABLES
y = data['Survived']

In [78]:
x.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### MISSING VALLUE COLUMNS

In [79]:
x.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## Handling missing values

In [80]:
# DELETING THE CABIN COLUMN BECAUSE IT HAS MANY MISSING VALUES
x = data.drop('Cabin', axis=1)

#PUTTING A MEAN FOR THE AGE COLUMN 
x['Age'] = x['Age'].fillna(x['Age'].mean().round(0))

#USING THE MOST FREQUENT CATEGORY FOR THE MODE 
x['Embarked'] = x['Embarked'].fillna(x['Embarked'].mode()[0])

### checking if all the columns are filled

In [81]:
x.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

# 5. ENCODING DATA

In [82]:
# first we drop the name and ticket columns because they cannot be used to predict survival

x = x.drop(['Name','Ticket','Survived'], axis=1)

# next we encode the

In [83]:
# CATEGORICAL DATA
# from sklearn.preprocessing import LabelEncoder
# le_x = LabelEncoder()
# x['State'] = le_x.fit_transform(x['State'])

In [84]:
x = pd.get_dummies(x,columns=['Sex','Embarked'], prefix=['Sex','Embarked'], drop_first=True , dtype=np.int64)
x.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,1,3,22.0,1,0,7.2500,1,0,1
1,2,1,38.0,1,0,71.2833,0,0,0
2,3,3,26.0,0,0,7.9250,0,0,1
3,4,1,35.0,1,0,53.1000,0,0,1
4,5,3,35.0,0,0,8.0500,1,0,1

In [85]:
from sklearn.model_selection import train_test_split
x_trian, x_test, y_train, y_test = train_test_split(x,y, test_size=0.2, random_state=0)

## STANDARDIZATION OF DATA

In [86]:
from sklearn.preprocessing import StandardScaler

std_x = StandardScaler()
x_test = std_x.fit_transform(x_test)
x_trian = std_x.fit_transform(x_trian)